#include "pokemon.h"

Pokemon createPokemon(const std::string& name) {
    if (name == "이상해꽃") return { "이상해꽃",50, 160, 100, 122, 122, 90, "씨뿌리기", "덩굴채찍", "몸통박치기", "회오리" };
    if (name == "리자몽") return { "리자몽", 50, 156, 104, 98, 135, 120, "불꽃세례", "몸통박치기", "할퀴기", "화염방사" };
    if (name == "거북왕") return { "거북왕", 50, 158, 103, 120, 121, 91, "물대포", "몸통박치기", "거품", "하이드로펌프" };
    if (name == "윈디") return { "윈디", 50, 110, 80, 95, 120, 90, "신속", "화염자동차", "몸통박치기", "번개엄니" };
    if (name == "헬가") return { "헬가", 50, 90, 50, 95, 110, 75, "기습", "화염방사", "악의파동", "불꽃엄니" };
    if (name == "갸라도스") return { "갸라도스", 50, 125, 79, 81, 100, 95, "하이드로펌프", "물의파동", "물기", "깨물어부수기" };
    if (name == "스라크") return { "스라크", 50, 110, 80, 105, 95, 70, "연속자르기", "풀베기", "벌레먹음", "깜짝베기" };
    if (name == "별가사리") return { "별가사리", 50, 45, 55, 85, 70, 30, "물대포", "하이드로펌프", "몸통박치기", "사이코키네시스" };
    if (name == "리오르") return { "리오르", 50, 70, 40, 60, 85, 40, "카운터", "아이언해드", "발경", "몸통박치기" };
    if (name == "아쿠스타") return { "아쿠스타", 50, 75, 85, 115, 90, 60, "번개", "물대포", "냉동빔", "사이코키네시스" };
    if (name == "아리아도스") return { "아리아도스", 50, 90, 70, 40, 80, 70, "독침", "독찌르기", "벌레먹음", "몸통박치기" };
    if (name == "코코파스") return { "코코파스", 50, 100, 115, 35, 60, 60, "돌던지기", "스톤에지", "몸통박치기", "바위깨기" };
    if (name == "루카리오") return { "루카리오", 50, 110, 70, 90, 100, 70, "파동탄", "카운터", "본러쉬", "점프킥" };
    if (name == "기기기어르") return { "기기기어르", 50, 100, 115, 90, 80, 60, "차지빔", "기어소서", "트라이어택", "몸통박치기" };
    if (name == "대왕끼리동") return { "대왕끼리동", 50, 130, 69, 30, 75, 122, "지진", "아이언해드", "들이받기", "몸통박치기" };
    if (name == "플로젤") return { "플로젤", 50, 105, 55, 115, 95, 85, "아쿠아테일", "파도타기", "몸통박치기", "괴력" };
    if (name == "렌트라") return { "렌트라", 50, 120, 79, 70, 90, 80, "물기", "번개엄니", "스파크", "와일드볼트" };
    if (name == "킹드라") return { "킹드라", 50, 95, 95, 85, 85, 75, "하이드로캐논", "용의분노", "용의파동", "화염방사" };
    if (name == "밀로틱") return { "밀로틱", 50, 60, 79, 81, 100, 95, "폭포오르기", "파도타기", "열탕", "풀묶기" };
    if (name == "메타그로스") return { "메타그로스", 50, 135, 130, 70, 110, 80, "불릿펀치", "코멧펀치", "사념의박치기", "괴력" };

    return { "이상해씨", 45, 49, 49, 45, 45,0, "몸통박치기", "없음", "없음", "없음" };
}

Pokemon createPokemon(const std::string& name, int level, int hp, int attack, int defense, int speed,
    const std::string& skill1, const std::string& skill2, const std::string& skill3, const std::string& skill4) {
    Pokemon p;
    p.name = name;
    p.level = level;
    p.hp = hp;
    p.attack = attack;
    p.defense = defense;
    p.speed = speed;
    p.skill1 = skill1;
    p.skill2 = skill2;
    p.skill3 = skill3;
    p.skill4 = skill4;
    return p;
}